<template>




        <popup v-model="isShow" height="100%">
            <div class="mainContent">
                <divider>用户协议</divider>
                <step v-model="step" background-color='#fbf9fe' v-if="agreements.length>0">
                    <template v-for="i in agreements">
                        <step-item title="" description="" ></step-item>
                    </template>

                </step>

                <section>
                    <Card v-for="(item,index) in agreements" v-if="index===step">
                        {{item}}
                    </Card>
                </section>

                <div style="margin-top: 1em;">
                    <x-button type="primary" @click.native="nextStep">同意</x-button>
                    <x-button @click.native="hide">不同意</x-button>
                </div>
            </div>
        </popup>




</template>

<script>
    import {Util} from '../assets/js/Util'

    export default {
        components: {
        },
        data() {
            return {
                isShow:false,
                step: 0,
                agreements:[]
            }
        },
        computed: {},
        mounted() {
        },
        methods: {
            show(){
                this.isShow=true;
                this.getAgreements();
            },
            hide(){
                this.isShow=false;
            },
            getAgreements(){
              this.agreements=  [
                  '您确认，在您注册成为移动云用户以接受本服务之前，您已充分阅读、理解并接受本协议的全部内容，一旦您选择“同意”并完成注册开启流程或使用本服务，即表示您同意遵循本协议之所有约定。您同意，本公司有权通过在本网站（https://ecloud.10086.cn/）以公告的方式对本协议内容进行单方面的变更，而无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务； 若您不同意修改后的协议内容，您应以适当方式停止使用本服务。 您声明，在您同意接受本协议并注册成为移动云用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。',
                  '接受本协议的全部内容，一旦您选择“同意”并完成注册开启流程或使用本服务，即表示您同意遵循本协议之所有约定。您同意，本公司有权通过在本网站（https://ecloud.10086.cn/）以公告的方式对本协议内容进行单方面的变更，而无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务； 若您不同意修改后的协议内容，您应以适当方式停止使用本服务。 您声明，在您同意接受本协议并注册成为移动云用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。',
                  '受本服务之前，您已充分阅读、理解并接受本协议的全部内容，一旦您选择“同意”并完成注册开启流程或使用本服务，即表示您同意遵循本协议之所有约定。您同意，本公司有权通过在本网站（https://ecloud.10086.cn/）以公告的方式对本协议内容进行单方面的变更，而无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务； 若您不同意修改后的协议内容，您应以适当方式停止使用本服务。 您声明，在您同意接受本协议并注册成为移动云用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。',
                  '意”并完成注册开启流程或使用本服务，即表示您同意遵循本协议之所有约定。您同意，本公司有权通过在本网站（https://ecloud.10086.cn/）以公告的方式对本协议内容进行单方面的变更，而无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务； 若您不同意修改后的协议内容，您应以适当方式停止使用本服务。 您声明，在您同意接受本协议并注册成为移动云用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。',
                  '示您同意遵循本协议之所有约定。您同意，本公司有权通过在本网站（https://ecloud.10086.cn/）以公告的方式对本协议内容进行单方面的变更，而无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务； 若您不同意修改后的协议内容，您应以适当方式停止使用本服务。 您声明，在您同意接受本协议并注册成为移动云用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。',
                  '循本协议之所有约定。您同意，本公司有权通过在本网站（https://ecloud.10086.cn/）以公告的方式对本协议内容进行单方面的变更，而无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务； 若您不同意修改后的协议内容，您应以适当方式停止使用本服务。 您声明，在您同意接受本协议并注册成为移动云用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。',
                  '遵循本协议之所有约定。您同意，本公司有权通过在本网站（https://ecloud.10086.cn/）以公告的方式对本协议内容进行单方面的变更，而无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务； 若您不同意修改后的协议内容，您应以适当方式停止使用本服务。 您声明，在您同意接受本协议并注册成为移动云用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。',
                  '循本协议之所有约定。您同意，本公司有权通过在本网站（https://ecloud.10086.cn/）以公告的方式对本协议内容进行单方面的变更，而无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务； 若您不同意修改后的协议内容，您应以适当方式停止使用本服务。 您声明，在您同意接受本协议并注册成为移动云用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。',
                  '遵循本协议之所有约定。您同意，本公司有权通过在本网站（https://ecloud.10086.cn/）以公告的方式对本协议内容进行单方面的变更，而无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务； 若您不同意修改后的协议内容，您应以适当方式停止使用本服务。 您声明，在您同意接受本协议并注册成为移动云用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。',
                  '独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务； 若您不同意修改后的协议内容，您应以适当方式停止使用本服务。 您声明，在您同意接受本协议并注册成为移动云用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区法律的排斥。不具备前述条件的，您应立即终止注册或停止使用本服务。',

              ]
            },
            nextStep () {
                if(this.step<this.agreements.length-1){
                    this.step ++
                }else{
                    this.$vux.toast.text('您已同意！！', 'middle')
                    this.hide();
                }

            }




        }
    }
</script>

<style scoped>

    .mainContent {
        width: 98%;
        margin-left: 1%;
        margin-bottom: 5%;
    }
</style>
